const minus = require('./minus');
// 4 - 1 เท่ากับ 3
test('4 - 1 เท่ากับ 3', ()=> {
    expect(minus(4,1)).toBe(3);
});

// 100 - 50 เท่ากับ 50
test('100 - 50 เท่ากับ 50', ()=> {
    expect(minus(100,50)).toBe(50);
});

// 1 - 4 เท่ากับ -3
test('1 - 4 เท่ากับ -3', ()=> {
    expect(minus(1,4)).toBe(-3);
});

// 20 - 50 เท่ากับ -30
test('20 - 50 เท่ากับ -30', ()=> {
    expect(minus(20,50)).toBe(-30);
});

// 1999 - 999 เท่ากับ 1000
test('1999 - 999 เท่ากับ 1000', ()=> {
    expect(minus(1999,999)).toBe(1000);
});